toitlang/toit/src/os_esp32.cc
// Copyright (C) 2018 Toitware ApS.
//
// This library is free software; you can redistribute it and/or
// modify it under the terms of the GNU Lesser General Public
// License as published by the Free Software Foundation; version
// 2.1 only.
//
// This library is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
// Lesser General Public License for more details.
//
// The license can be found in the file `LICENSE` in the top level
// directory of this repository.

#include "top.h"

#ifdef TOIT_ESP32

#include <esp_efuse.h>
#include <esp_chip_info.h>
#include <esp_heap_caps.h>
#include <esp_log.h>
#include <esp_sleep.h>
#include <esp_timer.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <hal/efuse_hal.h>
#include <malloc.h>
#include <sys/time.h>
#include <sys/queue.h>

#include "driver/uart.h"
#include "flags.h"
#include "heap_report.h"
#include "memory.h"
#include "os.h"
#include "rtc_memory_esp32.h"
#include "scheduler.h"
#include "utils.h"
#include "vm.h"

#include <soc/soc.h>
#include <soc/uart_reg.h>
#include <hal/efuse_hal.h>

#if CONFIG_IDF_TARGET_ESP32
  #include <esp32/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32C3
  #include <esp32c3/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32C6
  #include <esp32c6/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32H2
  #include <esp32h2/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32P4
  #include <esp32p4/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32S2
  #include <esp32s2/rtc.h>
#elif CONFIG_IDF_TARGET_ESP32S3
  #include <esp32s3/rtc.h>
#else
  #error "Unknown target"
#endif

#include "uuid.h"

namespace toit {

// Flags used to get memory for the Toit heap, which needs to be fast and 8-bit
// capable.  We will set this to the most useful value when we have detected
// which types of RAM are available.
bool OS::use_spiram_for_heap_ = false;
bool OS::use_spiram_for_metadata_ = false;

static const int EXTERNAL_CAPS = MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM;
static const int INTERNAL_CAPS = MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA;

int OS::toit_heap_caps_flags_for_heap() {
  if (use_spiram_for_heap()) {
    return EXTERNAL_CAPS;
  } else {
    return INTERNAL_CAPS;
  }
}

int OS::toit_heap_caps_flags_for_metadata() {
  if (use_spiram_for_metadata()) {
    return EXTERNAL_CAPS;
  } else {
    return INTERNAL_CAPS;
  }
}

void panic_put_char(char c) {
  while (((READ_PERI_REG(UART_STATUS_REG(CONFIG_ESP_CONSOLE_UART_NUM)) >> UART_TXFIFO_CNT_S)&UART_TXFIFO_CNT) >= 126) ;
  WRITE_PERI_REG(UART_FIFO_REG(CONFIG_ESP_CONSOLE_UART_NUM), c);
}

void panic_put_string(const char* str) {
  for (int i = 0; str[i]; i++) panic_put_char(str[i]);
}

void panic_put_hex(uword hex) {
  bool printing = false;
  for (int i = 28; i >= 0; i -= 4) {
    int digit = (hex >> i) & 0xf;
    if (printing || digit != 0 || i == 0) {
      panic_put_char("0123456789abcdef"[digit]);
      printing = true;
    }
  }
}

int64 OS::get_system_time() {
  // The esp_rtc_get_time_us method returns the time since RTC was cleared,
  // that is, any non-deep-sleep wakeups.
  return esp_rtc_get_time_us();
}

int OS::num_cores() {
  esp_chip_info_t info;
  esp_chip_info(&info);
  return info.cores;
}

void OS::close(int fd) {
  // Do nothing.
}

// Condition variables must not share the task-notification slot. Other users
// of that slot, or a timed-out wait, can leave notification bits behind for an
// unrelated condition variable wait on the same task. A stale semaphore give
// can only cause a conventional spurious wakeup on its owning thread.
__thread SemaphoreHandle_t condition_wake_semaphore_ = null;

struct ConditionWaitTimer {
  SemaphoreHandle_t wake;
  SemaphoreHandle_t callback_complete;
  esp_timer_handle_t timer;
};

// A native thread can only wait on one condition variable at a time, so one
// timer per thread is sufficient. Toit task timers are multiplexed separately
// by TimerEventSource; they do not each block a native thread.
__thread ConditionWaitTimer condition_wait_timer_{};

static SemaphoreHandle_t current_condition_wake_semaphore() {
  if (condition_wake_semaphore_ == null) {
    condition_wake_semaphore_ = xSemaphoreCreateBinary();
  }
  return condition_wake_semaphore_;
}

static void condition_wait_timeout(void* arg) {
  auto timer = reinterpret_cast<ConditionWaitTimer*>(arg);
  // The condition may have been signaled at the same time as the timeout. In
  // that case the binary wake semaphore is already full, which is fine.
  xSemaphoreGive(timer->wake);
  if (xSemaphoreGive(timer->callback_complete) != pdTRUE) {
    FATAL("condition-variable timer callback completed twice");
  }
}

static ConditionWaitTimer* current_condition_wait_timer() {
  ConditionWaitTimer* result = &condition_wait_timer_;
  if (result->timer == null) {
    result->wake = current_condition_wake_semaphore();
    result->callback_complete = xSemaphoreCreateBinary();
    if (result->wake == null || result->callback_complete == null) {
      FATAL("unable to allocate condition wait timer semaphores");
    }
    esp_timer_create_args_t args{};
    args.callback = condition_wait_timeout;
    args.arg = result;
    args.name = "toit condition wait";
    if (esp_timer_create(&args, &result->timer) != ESP_OK) {
      FATAL("unable to allocate condition wait timer");
    }
  }
  return result;
}

// Inspired by pthread_cond_t impl on esp32-idf.
struct ConditionVariableWaiter {
  SemaphoreHandle_t wake;
  bool signaled;
  bool uses_timer;
  // Link to next semaphore to be notified.
  TAILQ_ENTRY(ConditionVariableWaiter) link;
};

class ConditionVariable {
 public:
  explicit ConditionVariable(Mutex* mutex)
    : mutex_(mutex) {
    TAILQ_INIT(&waiter_list_);
  }

  ~ConditionVariable() {}

  void wait() {
    wait_ticks(portMAX_DELAY);
  }

  bool wait_us(int64 us) {
    if (us <= 0LL) return false;

    if (!mutex_->is_locked()) {
      FATAL("wait on unlocked mutex");
    }

