toitlang/toit/src/os_esp32.cc
    ConditionWaitTimer* timer = current_condition_wait_timer();
    // Every timed wait finishes or cancels its callback before returning, so
    // both semaphores must be empty here.
    if (xSemaphoreTake(timer->wake, 0) == pdTRUE ||
        xSemaphoreTake(timer->callback_complete, 0) == pdTRUE) {
      FATAL("stale condition-variable timer wakeup");
    }

    ConditionVariableWaiter w{};
    w.wake = timer->wake;
    w.uses_timer = true;
    TAILQ_INSERT_TAIL(&waiter_list_, &w, link);

    if (esp_timer_start_once(timer->timer, us) != ESP_OK) {
      FATAL("unable to start condition wait timer");
    }

    mutex_->unlock();

    if (xSemaphoreTake(w.wake, portMAX_DELAY) != pdTRUE) {
      FATAL("condition-variable timer wait failed");
    }

    mutex_->lock();

    esp_err_t stop_result = esp_timer_stop(timer->timer);
    if (stop_result == ESP_ERR_INVALID_STATE) {
      // The timer is removed from the timer queue before its callback runs.
      // Wait for the callback so it cannot leave a wakeup behind for the next
      // condition-variable wait on this thread.
      if (xSemaphoreTake(timer->callback_complete, portMAX_DELAY) != pdTRUE) {
        FATAL("condition-variable timer callback wait failed");
      }
    } else if (stop_result != ESP_OK) {
      FATAL("unable to stop condition wait timer");
    }

    if (w.signaled) {
      // A simultaneous timer expiry and condition signal can each give the
      // binary semaphore. Consume the second wakeup before reusing it.
      xSemaphoreTake(w.wake, 0);
    } else {
      TAILQ_REMOVE(&waiter_list_, &w, link);
    }

    return w.signaled;
  }

  bool wait_ticks(uint32 ticks) {
    if (!mutex_->is_locked()) {
      FATAL("wait on unlocked mutex");
    }

    ConditionVariableWaiter w{};
    w.wake = current_condition_wake_semaphore();
    if (w.wake == null) FATAL("unable to allocate condition wake semaphore");

    TAILQ_INSERT_TAIL(&waiter_list_, &w, link);

    mutex_->unlock();

    bool woke = xSemaphoreTake(w.wake, ticks) == pdTRUE;

    mutex_->lock();
    if (w.signaled) {
      // If the semaphore wait timed out, a signal claimed this waiter while it
      // was reacquiring the mutex. Consume that signal before reusing the
      // task-local semaphore for another condition-variable wait.
      if (!woke && xSemaphoreTake(w.wake, 0) != pdTRUE) {
        FATAL("condition-variable signal without semaphore wakeup");
      }
    } else {
      // No signal claimed this waiter, so it is still on the list.
      TAILQ_REMOVE(&waiter_list_, &w, link);
      if (woke) FATAL("condition-variable wakeup without signal");
    }

    return w.signaled;
  }

  void signal() {
    if (!mutex_->is_locked()) {
      FATAL("signal on unlocked mutex");
    }
    ConditionVariableWaiter* entry = TAILQ_FIRST(&waiter_list_);
    if (entry) {
      TAILQ_REMOVE(&waiter_list_, entry, link);
      entry->signaled = true;
      if (xSemaphoreGive(entry->wake) != pdTRUE && !entry->uses_timer) {
        FATAL("unable to signal condition variable");
      }
    }
  }

  void signal_all() {
    if (!mutex_->is_locked()) {
      FATAL("signal_all on unlocked mutex");
    }
    while (ConditionVariableWaiter* entry = TAILQ_FIRST(&waiter_list_)) {
      TAILQ_REMOVE(&waiter_list_, entry, link);
      entry->signaled = true;
      if (xSemaphoreGive(entry->wake) != pdTRUE && !entry->uses_timer) {
        FATAL("unable to signal condition variable");
      }
    }
  }

 private:
  Mutex* mutex_;

  // Head of the list of semaphores.
  TAILQ_HEAD(, ConditionVariableWaiter) waiter_list_;
};

const int DEFAULT_STACK_SIZE = 2 * KB;

// Use C++x11 thread local variables for thread pointer.
// See
//   https://docs.espressif.com/projects/esp-idf/en/latest/esp32c3/api-guides/thread-local-storage.html
//   https://gcc.gnu.org/onlinedocs/gcc-5.5.0/gcc/Thread-Local.html#Thread-Local
__thread Thread* current_thread_ = null;

struct ThreadData {
  TaskHandle_t handle;
  SemaphoreHandle_t terminated;
};

Thread::Thread(const char* name)
    : name_(name)
    , handle_(null)
    , locker_(null) {}

void* thread_start(void* arg) {
  Thread* thread = unvoid_cast<Thread*>(arg);
  thread->_boot();
  return null;
}

static void esp_thread_start(void* arg) {
  thread_start(arg);
}

void Thread::_boot() {
  auto thread = reinterpret_cast<ThreadData*>(handle_);
  current_thread_ = this;
  ASSERT(current() == this);
  HeapTagScope scope(ITERATE_CUSTOM_TAGS + OTHER_THREADS_MALLOC_TAG);
  entry();
  // Timed waits always cancel or finish their callback before returning, so
  // no callback can use these semaphores after the native thread exits.
  if (condition_wait_timer_.timer != null) {
    if (esp_timer_delete(condition_wait_timer_.timer) != ESP_OK) {
      FATAL("unable to delete condition wait timer");
    }
    condition_wait_timer_.timer = null;
    vSemaphoreDelete(condition_wait_timer_.callback_complete);
    condition_wait_timer_.callback_complete = null;
  }
  if (condition_wake_semaphore_ != null) {
    vSemaphoreDelete(condition_wake_semaphore_);
    condition_wake_semaphore_ = null;
  }
  xSemaphoreGive(thread->terminated);
  vTaskDelete(null);
}

bool Thread::spawn(int stack_size, int core) {
  HeapTagScope scope(ITERATE_CUSTOM_TAGS + THREAD_SPAWN_MALLOC_TAG);
  ThreadData* thread = _new ThreadData();
  if (thread == null) return false;
  thread->terminated = xSemaphoreCreateBinary();
  if (thread->terminated == null) {
    delete thread;
    return false;
  }
  handle_ = void_cast(thread);

  if (stack_size == 0) stack_size = DEFAULT_STACK_SIZE;
  if (core == -1) core = tskNO_AFFINITY;

  BaseType_t res = xTaskCreatePinnedToCore(
    esp_thread_start,
    name_,
    stack_size,
    this,
    tskIDLE_PRIORITY + 1,  // We want to be scheduled before IDLE, but still after WiFi, etc.
    &thread->handle,
    core);
  if (res != pdPASS) {
    vSemaphoreDelete(thread->terminated);
    delete thread;
    return false;
  }
  return true;
}

// Run on current thread.
void Thread::run() {
  ASSERT(handle_ == null);
  thread_start(void_cast(this));
}

void Thread::cancel() {
  // No-op on ESP32. The thread will check for STOPPED state after
  // completing its current work item.
}

void Thread::join() {
  ASSERT(handle_ != null);
  auto thread = reinterpret_cast<ThreadData*>(handle_);
  if (xSemaphoreTake(thread->terminated, portMAX_DELAY) != pdTRUE) {
    FATAL("Thread join failed");
  }
  vSemaphoreDelete(thread->terminated);
  delete thread;
  handle_ = null;
}

void Thread::ensure_system_thread() {
  Thread* t = current_thread_;
  if (t != null) return;
  Thread* thread = _new SystemThread();
  if (thread == null) FATAL("unable to allocate SystemThread");
  current_thread_ = thread;
}

Thread* Thread::current() {
  Thread* result = current_thread_;
  if (result == null) FATAL("thread must be present");
  return result;
}

void OS::set_up() {
  Thread::ensure_system_thread();
  set_up_mutexes();
  // This will normally return 100 or 300.  Perhaps later, more
  // CPU revisions will appear.
  cpu_revision_ = efuse_hal_chip_revision();
#if defined(CONFIG_IDF_TARGET_ESP32)
  const char* chip_name = "ESP32";
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  const char* chip_name = "ESP32C3";
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
  const char* chip_name = "ESP32C6";
#elif defined(CONFIG_IDF_TARGET_ESP32H2)
  const char* chip_name = "ESP32H2";
#elif defined(CONFIG_IDF_TARGET_ESP32P4)
  const char* chip_name = "ESP32P4";
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  const char* chip_name = "ESP32S2";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  const char* chip_name = "ESP32S3";
#else
  #error "Unknown target"
#endif
  printf("[toit] INFO: running on %s - revision %d.%d\n", chip_name, cpu_revision_ / 100, cpu_revision_ % 100);
}

// Mutex forwarders.
Mutex* OS::allocate_mutex(int level, const char* title) { return _new Mutex(level, title); }
void OS::dispose(Mutex* mutex) { delete mutex; }
bool OS::is_locked(Mutex* mutex) { return mutex->is_locked(); }  // For asserts.
void OS::lock(Mutex* mutex) { mutex->lock(); }
void OS::unlock(Mutex* mutex) { mutex->unlock(); }

