toitlang/toit/src/os_esp32.cc
// Condition variable forwarders.
ConditionVariable* OS::allocate_condition_variable(Mutex* mutex) { return _new ConditionVariable(mutex); }
void OS::wait(ConditionVariable* condition) { condition->wait(); }
bool OS::wait_us(ConditionVariable* condition, int64 us) { return condition->wait_us(us); }
void OS::signal(ConditionVariable* condition) { condition->signal(); }
void OS::signal_all(ConditionVariable* condition) { condition->signal_all(); }
void OS::dispose(ConditionVariable* condition) { delete condition; }

void* OS::allocate_pages(uword size) {
  size = Utils::round_up(size, TOIT_PAGE_SIZE);
  HeapTagScope scope(ITERATE_CUSTOM_TAGS + TOIT_HEAP_MALLOC_TAG);
  void* allocation = heap_caps_aligned_alloc(TOIT_PAGE_SIZE, size, toit_heap_caps_flags_for_heap());
  return allocation;
}

void OS::free_pages(void* address, uword size) {
  heap_caps_free(address);
}

void* OS::grab_virtual_memory(void* address, uword size) {
  // On ESP32 this is only used for allocating the heap metadata.  We put this
  // in the same space as the heap itself.
  return heap_caps_malloc(size, toit_heap_caps_flags_for_metadata());
}

void OS::ungrab_virtual_memory(void* address, uword size) {
  free(address);
}

bool OS::use_virtual_memory(void* address, uword size) {
  return true;
}

void OS::unuse_virtual_memory(void* address, uword size) {}

OS::HeapMemoryRange OS::get_heap_memory_range() {
  multi_heap_info_t info{};

  int caps = EXTERNAL_CAPS;
  heap_caps_get_info(&info, caps);

  bool use_spiram = info.lowest_address != null;

#if !defined(CONFIG_CMPCT_MALLOC_HEAP)
  printf("[toit] WARN: not using cmpctmalloc - memory is not used efficiently\n");
#if defined(CONFIG_SPIRAM)
  printf("[toit] INFO: not using cmpctmalloc - cannot detect any SPIRAM\n");
#endif
#endif

#ifdef CONFIG_TOIT_SPIRAM_HEAP
  if (use_spiram) {
#if defined(CONFIG_IDF_TARGET_ESP32) && !defined(CONFIG_SPIRAM_CACHE_WORKAROUND)
    int cpu_revision = efuse_hal_chip_revision();
    if (cpu_revision < 300) {
      printf("[toit] INFO: SPIRAM detected, but CPU revision is only %d.%d\n", cpu_revision / 100, cpu_revision % 100);
      printf("[toit] INFO: no SPIRAM cache workaround configured\n");
      printf("[toit] INFO: not using SPIRAM\n");
      use_spiram = false;
    }
#endif
  }
#else  // ndef CONFIG_TOIT_SPIRAM_HEAP.
  if (use_spiram) {
    printf("[toit] INFO: SPIRAM detected, but Toit is not configured to use it\n");
    use_spiram = false;
  }
#endif
  if (use_spiram) {
    use_spiram_for_metadata_ = true;
    use_spiram_for_heap_ = true;
    printf("[toit] INFO: using SPIRAM for heap metadata and heap\n");
  }

  caps = toit_heap_caps_flags_for_heap();
  heap_caps_get_info(&info, caps);

  // Older esp-idfs or mallocs other than cmpctmalloc won't set the
  // lowest_address and highest_address fields.
  if (info.lowest_address != null) {
    HeapMemoryRange range;
    range.address = info.lowest_address;
    range.size = reinterpret_cast<uword>(info.highest_address) - reinterpret_cast<uword>(info.lowest_address);
    return range;
  }

  // In this case use hard coded ranges for internal RAM, covering the
  // chip's main DRAM region. The GC's ONLY_FOR_MALLOC adjustment trims
  // the low part of the range that's used for C allocations only.
  HeapMemoryRange range;
  range.address = reinterpret_cast<void*>(SOC_DRAM_LOW);
#ifdef CONFIG_IDF_TARGET_ESP32P4
  // The top CONFIG_CACHE_L2_CACHE_SIZE bytes of HP L2MEM are
  // used by the L2 cache and not available as heap.
  range.size = SOC_DRAM_HIGH - CONFIG_CACHE_L2_CACHE_SIZE - SOC_DRAM_LOW;
#else
  range.size = SOC_DRAM_HIGH - SOC_DRAM_LOW;
#endif
  return range;
}

void OS::tear_down() {
  // Shutting down quickly is very important on the ESP32, so we
  // simply avoid freeing memory and resources here.
}

const char* OS::get_platform() {
  return "FreeRTOS";
}

const char* OS::get_architecture() {
#if defined(CONFIG_IDF_TARGET_ESP32)
  return "esp32";
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  return "esp32c3";
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
  return "esp32c6";
#elif defined(CONFIG_IDF_TARGET_ESP32H2)
  return "esp32h2";
#elif defined(CONFIG_IDF_TARGET_ESP32P4)
  return "esp32p4";
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  return "esp32s2";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  return "esp32s3";
#else
  #error "Unknown architecture"
#endif
}

int OS::read_entire_file(char* name, uint8** buffer) {
  return -1;
}

void OS::out_of_memory(const char* reason) {
  RtcMemory::on_out_of_memory();

  // The heap fragmentation dumper code has been temporarily disabled.
  // See https://github.com/toitware/toit/issues/3153.
  if (true) {
    panic_put_string(reason);
    panic_put_string("; restarting to attempt to recover.\n");

    // We use deep sleep here to preserve the RTC memory that contains our
    // bookkeeping data for out-of-memory situations. Using esp_restart()
    // might clear the RTC memory.
    esp_sleep_enable_timer_wakeup(100000);  // 100 ms.
    RtcMemory::on_deep_sleep_start();
    esp_deep_sleep_start();
  }

#ifdef TOIT_CMPCTMALLOC

  panic_put_string(reason);
  panic_put_string("; dumping flash partition and restarting to attempt to recover.\n");
  // Write to core dump flash partition.

  int num_tasks = uxTaskGetNumberOfTasks();
  TaskStatus_t tasks[num_tasks];
  num_tasks = uxTaskGetSystemState(tasks, num_tasks, null);

  for (int i = 0; i < num_tasks; i++) {
    if (tasks[i].xHandle != xTaskGetCurrentTaskHandle() && strncmp(tasks[i].pcTaskName, "IDLE", 4) != 0) {
      vTaskSuspend(tasks[i].xHandle);
    }
  }

  dump_heap_fragmentation(&panic_put_char);

  for (int i = 0; i < num_tasks; i++) {
    if (tasks[i].xHandle != xTaskGetCurrentTaskHandle() && strncmp(tasks[i].pcTaskName, "IDLE", 4) != 0) {
      vTaskResume(tasks[i].xHandle);
    }
  }

#endif // def TOIT_CMPCTMALLOC

  // TODO(kasper): This should probably be avoided because it clears RTC memory.
  esp_restart();
}

#ifdef TOIT_CMPCTMALLOC

void OS::set_heap_tag(word tag) {
  heap_caps_set_option(MALLOC_OPTION_THREAD_TAG, reinterpret_cast<void*>(tag));
}

word OS::get_heap_tag() {
  return reinterpret_cast<word>(heap_caps_get_option(MALLOC_OPTION_THREAD_TAG));
}

class HeapSummaryPage {
  uword MASK_ = ~(TOIT_PAGE_SIZE - 1);
 public:

  HeapSummaryPage() {
    set_address(null);
  }

  bool unused() {
    return address_ == 0;
  }

  bool matches(void* a) {
    uword address = reinterpret_cast<uword>(a);
    return (address & MASK_) == address_;
  }

