toitlang/toit/src/os_esp32.cc
  void set_address(void* a) {
    address_ = (reinterpret_cast<uword>(a) & MASK_);
    memset(void_cast(sizes_), 0, sizeof sizes_);
    memset(void_cast(counts_), 0, sizeof counts_);
    users_ = 0;
    largest_free_ = 0;
    owning_process_ = null;
  }

  int register_user(uword tag, uword size) {
    uint16 saturated_size = Utils::min(size, 0xffffu);
    int type = compute_allocation_type(tag);
    users_ |= 1 << type;
    sizes_[type] += saturated_size;
    counts_[type]++;
    if (type == FREE_MALLOC_TAG) {
      largest_free_ = Utils::max(largest_free_, saturated_size);
    }
    return type;
  }

  void print() {
    if (address_ == 0) return;
    printf("  ┌────────────┬─────────────────────────────────────────────┐\n");
    printf("  │ Page:      │   Largest free = %-5d                      │\n",
        largest_free_);
    printf("  │ %p ├───────────┬─────────┬───────────────────────┤\n",
        reinterpret_cast<void*>(address_));
    printf("  │            │   Bytes   │  Count  │  Type                 │\n");
    printf("  │            ├───────────┼─────────┼───────────────────────┤\n");
    for (int i = 0; i < NUMBER_OF_MALLOC_TAGS; i++) {
      if (users_ & (1 << i)) {
        printf("  │            │ %7d   │ %6d  │  %-20s │\n",
             sizes_[i], counts_[i], HeapSummaryPage::name_of_type(i));
      }
    }
    printf("  └────────────┴───────────┴─────────┴───────────────────────┘\n");
  }

  static const char* name_of_type(int tag) {
    switch (tag) {
      case MISC_MALLOC_TAG: return "misc";
      case EXTERNAL_BYTE_ARRAY_MALLOC_TAG: return "external byte array";
      case BIGNUM_MALLOC_TAG: return "tls/bignum";
      case EXTERNAL_STRING_MALLOC_TAG: return "external string";
      case TOIT_HEAP_MALLOC_TAG: return "toit processes";
      case FREE_MALLOC_TAG: return "free";
      case LWIP_MALLOC_TAG: return "lwip";
      case HEAP_OVERHEAD_MALLOC_TAG: return "heap overhead";
      case EVENT_SOURCE_MALLOC_TAG: return "event source";
      case OTHER_THREADS_MALLOC_TAG: return "thread/other";
      case THREAD_SPAWN_MALLOC_TAG: return "thread/spawn";
      case NULL_MALLOC_TAG: return "untagged";
      case WIFI_MALLOC_TAG: return "wifi";
    }
    return "unknown";
  }

  void set_owning_process(Process* process) { owning_process_ = process; }

 private:
  uword address_;
  // In order to increase the chances of being able to make a report
  // on a memory-limited ESP32 we use uint16 here, with a little risk
  // of overflow.
  uint16 users_;
  uint16 sizes_[NUMBER_OF_MALLOC_TAGS];
  uint16 counts_[NUMBER_OF_MALLOC_TAGS];
  uint16 largest_free_;
  uint16 largest_allocation_;
  Process* owning_process_;
};

class HeapSummaryCollector {
 public:
  HeapSummaryCollector(word max_pages, Process* current_process)
      : current_process_(current_process)
      , max_pages_(max_pages) {
    if (max_pages > 0) {
      pages_ = _new HeapSummaryPage[max_pages];
      out_of_memory_ = (pages_ == null);
    }
    memset(void_cast(sizes_), 0, sizeof sizes_);
    memset(void_cast(counts_), 0, sizeof counts_);
    memset(void_cast(toit_memory_), 0, sizeof toit_memory_);
    memset(void_cast(processes_), 0, sizeof processes_);
  }

  word allocation_requirement() {
    return max_pages_ * sizeof(HeapSummaryPage);
  }

  bool out_of_memory() const { return out_of_memory_; }

  ~HeapSummaryCollector() {
    delete[] pages_;
  }

  void register_allocation(void* t, void* address, uword size) {
    uword tag = reinterpret_cast<uword>(t);
    if (!current_page_ || !current_page_->matches(address)) {
      current_page_ = null;
      for (int i = 0; i < max_pages_; i++) {
        if (pages_[i].matches(address)) {
          current_page_ = &pages_[i];
          break;
        }
        bool unused = pages_[i].unused();
        if (unused || i == max_pages_ - 1) {
          current_page_ = &pages_[i];
          if (!unused) dropped_pages_++;
          current_page_->set_address(address);
          break;
        }
      }
    }
    int type = current_page_
        ? current_page_->register_user(tag, size)
        : compute_allocation_type(tag);
    sizes_[type] += size;
    counts_[type]++;
  }

  void identify_processes() {
    VM::current()->scheduler()->iterate_process_chunks(this, chunk_callback);
  }

  static void chunk_callback(void* context, Process* process, uword address, uword size) {
    reinterpret_cast<HeapSummaryCollector*>(context)->chunk_callback(process, address, size);
  }

  void chunk_callback(Process* process, uword address, uword size) {
    for (int i = 0; i < MAX_PROCESSES; i++) {
      if (processes_[i] == null || processes_[i] == process) {
        toit_memory_[i] += size;
        processes_[i] = process;
        break;
      }
    }
    while (size >= TOIT_PAGE_SIZE) {
      for (int i = 0; i < max_pages_; i++) {
        if (pages_[i].matches(reinterpret_cast<void*>(address))) {
          pages_[i].set_owning_process(process);
        }
      }
      size -= TOIT_PAGE_SIZE;
      address += TOIT_PAGE_SIZE;
    }
  }

  void print(const char* marker) {
    if (marker && strlen(marker) > 0) {
      printf("Heap report @ %s:\n", marker);
    } else {
      printf("Heap report:\n");
    }
    printf("  ┌───────────┬──────────┬─────────────────────────────────────────────────────┐\n");
    printf("  │   Bytes   │  Count   │  Type                                               │\n");
    printf("  ├───────────┼──────────┼─────────────────────────────────────────────────────┤\n");

    word size = 0;
    word count = 0;
    uword metadata_location, metadata_size;
    GcMetadata::get_metadata_extent(&metadata_location, &metadata_size);
    for (int i = 0; i < NUMBER_OF_MALLOC_TAGS; i++) {
      // Leave out free space and allocation types with no allocations.
      if (i == FREE_MALLOC_TAG || sizes_[i] == 0) continue;
      auto this_size = sizes_[i];
      if (i == TOIT_HEAP_MALLOC_TAG) {
        this_size -= TOIT_PAGE_SIZE + metadata_size;
      }
      printf("  │ %7d   │ %6d   │  %-50s │\n",
          this_size, counts_[i], HeapSummaryPage::name_of_type(i));
      size += sizes_[i];
      // The reported overhead isn't really separate allocations, so
      // don't count them as such.
      if (i != HEAP_OVERHEAD_MALLOC_TAG) {
        count += counts_[i];
      }
      if (i == TOIT_HEAP_MALLOC_TAG) {
        for (int j = 0; j < MAX_PROCESSES; j++) {
          if (processes_[j]) {
            const uint8* uuid = processes_[j]->program()->id();
            char uuid_buffer[37];
            bool is_system = VM::current()->scheduler()->is_boot_process(processes_[j]);
            bool is_current = current_process_ == processes_[j];
            sprintf(uuid_buffer, "%08x-%04x-%04x-%04x-%04x%08x",
                static_cast<int>(Utils::read_unaligned_uint32_be(uuid)),
                static_cast<int>(Utils::read_unaligned_uint16_be(uuid + 4)),
                static_cast<int>(Utils::read_unaligned_uint16_be(uuid + 6)),
                static_cast<int>(Utils::read_unaligned_uint16_be(uuid + 8)),
                static_cast<int>(Utils::read_unaligned_uint16_be(uuid + 10)),
                static_cast<int>(Utils::read_unaligned_uint32_be(uuid + 12)));
            printf("  │   %7d │   %6d │    %s%4d %s │\n",
                static_cast<int>(toit_memory_[j]),
                static_cast<int>(toit_memory_[j] / TOIT_PAGE_SIZE),
                is_system ? "system " : is_current ? "current" : "other  ",
                processes_[j]->id(),
                uuid_buffer);
          }
        }
        printf("  │ %7d   │      1   │  heap metadata                                      │\n"
               "  │ %7d   │      1   │  spare new-space                                    │\n",
               static_cast<int>(metadata_size),
               TOIT_PAGE_SIZE);
      }
    }

