toitlang/toit/src/os_esp32.cc
    multi_heap_info_t info;
    int caps = OS::toit_heap_caps_flags_for_heap();
    heap_caps_get_info(&info, caps);
    word capacity_bytes = info.total_allocated_bytes + info.total_free_bytes;
    word used_bytes = size * 100 / capacity_bytes;
    printf("  └───────────┴──────────┴─────────────────────────────────────────────────────┘\n");
    printf("  Total: %d bytes in %d allocations (%d%%), largest free %dk, total free %dk\n",
        static_cast<int>(size),
        static_cast<int>(count),
        static_cast<int>(used_bytes),
        static_cast<int>(info.largest_free_block >> 10),
        static_cast<int>(info.total_free_bytes >> 10));

    word page_count = 0;
    for (word i = 0; i < max_pages_; i++) {
      if (!pages_[i].unused()) page_count++;
    }
    if (page_count == 0) return;

    for (word i = 0; i < max_pages_; i++) {
      pages_[i].print();
    }
    if (dropped_pages_ > 0) {
      printf("\n  %d unreported pages, hit limit of %d.\n", dropped_pages_, max_pages_);
    }
  }

 private:
  static const int MAX_PROCESSES = 10;
  HeapSummaryPage* pages_ = null;
  HeapSummaryPage* current_page_ = null;
  uword sizes_[NUMBER_OF_MALLOC_TAGS];
  uword counts_[NUMBER_OF_MALLOC_TAGS];
  uword toit_memory_[MAX_PROCESSES];
  Process* processes_[MAX_PROCESSES];
  Process* current_process_;
  const word max_pages_;
  word dropped_pages_ = 0;
  bool out_of_memory_ = false;
};

bool register_allocation(void* self, void* tag, void* address, uword size) {
  auto collector = reinterpret_cast<HeapSummaryCollector*>(self);
  collector->register_allocation(tag, address, size);
  return false;
}

void OS::heap_summary_report(int max_pages, const char* marker, Process* process) {
  HeapSummaryCollector collector(max_pages, process);
  if (collector.out_of_memory()) {
    printf("Not enough memory for a heap report (%d bytes)\n", static_cast<int>(collector.allocation_requirement()));
    return;
  }
  int flags = ITERATE_ALL_ALLOCATIONS | ITERATE_UNALLOCATED;
  int caps = OS::toit_heap_caps_flags_for_heap();
  heap_caps_iterate_tagged_memory_areas(&collector, null, &register_allocation, flags, caps);
  collector.identify_processes();
  collector.print(marker);
}

#else // def TOIT_CMPCTMALLOC

void OS::set_heap_tag(word tag) {}
word OS::get_heap_tag() { return 0; }
void OS::heap_summary_report(int max_pages, const char* marker, Process* process) {}

#endif // def TOIT_CMPCTMALLOC

char* OS::getenv(const char* variable) {
  // Unimplemented on purpose.
  // We currently prefer not to expose environment variables on embedded devices.
  // There is no technical reason for it, so if circumstances change, one can
  // just add a call to `::getenv`.
  UNIMPLEMENTED();
}

bool OS::setenv(const char* variable, const char* value) {
  // Unimplemented on purpose.
  UNIMPLEMENTED();
}

bool OS::unsetenv(const char* variable) {
  // Unimplemented on purpose.
  UNIMPLEMENTED();
}

bool OS::set_real_time(struct timespec* time) {
  if (clock_settime(CLOCK_REALTIME, time) == 0) return true;
  struct timeval timeofday{};
  TIMESPEC_TO_TIMEVAL(&timeofday, time);
  return settimeofday(&timeofday, NULL) == 0;
}

}

#endif // TOIT_ESP32
